Процедура Управление(Коллекция)
    Пока Истина Цикл
        Прервать;
    КонецЦикла;

    Для Индекс = 0 По 10 Цикл
        Если Индекс = 5 Тогда
            Продолжить;
        ИначеЕсли Индекс > 8 Тогда
            Прервать;
        Иначе
            Сообщить(Индекс);
        КонецЕсли;
    КонецЦикла;

    Для Каждого Элемент Из Коллекция Цикл
        Попытка
            Обработать(Элемент);
        Исключение
            ВызватьИсключение ОписаниеОшибки();
        КонецПопытки;
    КонецЦикла;
КонецПроцедуры
