Перем Глобальная Экспорт;

&НаСервере
Процедура ВыполнитьДействие(Знач Параметр, Необязательный = Неопределено) Экспорт
    Перем Локальная;
    Если Необязательный = Неопределено Тогда
        Возврат;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначение() Экспорт
    Возврат Глобальная;
КонецФункции

&НаСервереБезКонтекста
Процедура СервернаяБезКонтекста()
КонецПроцедуры

&НаКлиентеНаСервере
Процедура КлиентскаяИСерверная()
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УниверсальнаяБезКонтекста()
КонецПроцедуры
